PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_scb_i2c.c
        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* The SCB is wakeup-capable: restore the slave interrupt sources */
            Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_I2C_SLAVE_INTR);
        }
        else
        {
            /* The SCB is NOT wakeup-capable: enable the I2C to operate */
            Cy_SCB_I2C_Enable(locBase);
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    {
        /* This code executes inside the critical section. Enabling the
        * active interrupt source makes the interrupt pending in the NVIC.
        * However, the interrupt processing is delayed until the code exits
        * the critical section. The pending interrupt force WFI instruction
        * does nothing and the device remains in Active mode.
        */

        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* The SCB is wakeup-capable: enable the I2C wakeup interrupt
            * source. If any transaction was paused, the I2C interrupt
            * becomes pending and prevents entering Deep Sleep mode.
            * The transaction continues as soon as the global interrupts
            * are enabled.
            */
            Cy_SCB_SetI2CInterruptMask(locBase, CY_SCB_I2C_INTR_WAKEUP);

            /* Disable SCB clock */
            SCB_I2C_CFG(locBase) &= (uint32_t) ~CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper entering Deep Sleep mode the I2C clock must be disabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_AFTER_TRANSITION:
    {
        if (_FLD2BOOL(SCB_CTRL_EC_AM_MODE, SCB_CTRL(locBase)))
        {
            /* Enable SCB clock */
            SCB_I2C_CFG(locBase) |= CY_SCB_I2C_CFG_CLK_ENABLE_Msk;

            /* IMPORTANT (replace line above for the CY8CKIT-062 rev-08):
            * for proper exiting Deep Sleep, the I2C clock must be enabled.
            * This code must be inserted by the user because the driver
            * does not have access to the clock.
            */

            /* The SCB is wakeup-capable: disable the I2C wakeup interrupt
            * source and restore slave interrupt sources.
            */
            Cy_SCB_SetI2CInterruptMask(locBase, CY_SCB_CLEAR_ALL_INTR_SRC);
            Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_I2C_SLAVE_INTR);
        }
        else
        {
            /* The SCB is NOT wakeup-capable: enable the I2C to operate */
            Cy_SCB_I2C_Enable(locBase);
        }

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


/*******************************************************************************
* Function Name: Cy_SCB_I2C_HibernateCallback
****************************************************************************//**
*
* This function handles the transition of the I2C SCB block into Hibernate
* mode. It prevents the device from entering Hibernate mode if the I2C slave or
* master is actively communicating.
* If the I2C is ready to enter Hibernate mode it is disabled. If the device
* failed to enter Hibernate mode, the SCB is enabled. After the SCB is disabled,
* it stops driving the outputs and ignores the inputs. The slave NACKs all
* incoming addresses.
*
* This function must be called during execution of \ref Cy_SysPm_SystemEnterHibernate.
* To do it, register this function as a callback before calling
* \ref Cy_SysPm_SystemEnterHibernate : specify \ref CY_SYSPM_HIBERNATE as the callback
* type and call \ref Cy_SysPm_RegisterCallback.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SCB_I2C_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode)
{
    CySCB_Type *locBase = (CySCB_Type *) callbackParams->base;
    cy_stc_scb_i2c_context_t *locContext = (cy_stc_scb_i2c_context_t *) callbackParams->context;

    cy_en_syspm_status_t retStatus = CY_SYSPM_FAIL;

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
    {
        /* Disable the slave interrupt sources to protect the state */
        Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_CLEAR_ALL_INTR_SRC);

        /* If the I2C is in the IDLE state, it is ready for Hibernate mode
        * (either the master or the slave is not busy).
        * Otherwise, return fail and restore the slave interrupt sources.
        */
        if (CY_SCB_I2C_IDLE == locContext->state)
        {
            /* Disable the I2C. The slave stops responding to the master and
            * the master stops driving the bus until the I2C is enabled.
            * This happens if the device failed to enter Hibernate mode.
            */
            Cy_SCB_I2C_Disable(locBase, locContext);

            retStatus = CY_SYSPM_SUCCESS;
        }

        /* Restore the slave interrupt sources */
        Cy_SCB_SetSlaveInterruptMask(locBase, CY_SCB_I2C_SLAVE_INTR);
    }
    break;

    case CY_SYSPM_CHECK_FAIL:
    {
        /* The other driver is not ready for Hibernate mode. Restore the
        * Active mode configuration.
        */

        /* Enable the I2C to operate */
        Cy_SCB_I2C_Enable(locBase);

        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    case CY_SYSPM_BEFORE_TRANSITION:
    case CY_SYSPM_AFTER_TRANSITION:
    {
        /* The SCB is not capable of waking up from Hibernate mode: do nothing */
        retStatus = CY_SYSPM_SUCCESS;
    }
    break;

    default:
        /* Unknown state */
        break;
    }

    return (retStatus);
}


